{
    "intents": [
        {
            "tag": "saludo",
            "patterns": [
                "¿Cómo estás?",
                "¿Qué tal estás?",
                "¿Cómo te encuentras?",
                "¿Qué hay de nuevo?",
                "¿Cómo te sientes?",
                "¿Qué pasa?",
                "¿Qué onda?",
                "¿Cómo va todo?",
                "¿Qué tal todo?",
                "¿Estás bien?",
                "buenos dias",
                "buenas noches",
                "buenas tardes",
                "hola, buenas"
            ],
            "responses": [
                "Estoy muy bien, gracias por preguntar.",
                "Me encuentro bastante bien, gracias por preguntar.",
                "Estoy bien, ¿y tú?",
                "Me siento bien, gracias por preguntar.",
                "Todo bien por acá, ¿y tú cómo estás?",
                "No me puedo quejar, ¿y tú?",
                "Todo está bien por acá, gracias por preguntar.",
                "Me siento genial, gracias por preguntar.",
                "Estoy bien, ¿y tú cómo estás?",
                "Todo está excelente, gracias por preguntar.",
                "uy ya es de dia, ¿en que te ayudo?",
                "uy ya es de noche, ¿en que te ayudo?",
                "uy ya es de tarde, ¿en que te ayudo?",
                "buenas, que necesitas?"
            ]
        },        
        {

            "tag": "nombre",
            "patterns": [
                "¿Cómo te llamas?",
                "¿Cuál es tu nombre?",
                "¿Quién eres?",
                "¿Cómo te denominas?",
                "¿Podrías decirme tu nombre?",
                "¿Cuál es tu apodo?",
                "¿Cómo debería llamarte?",
                "¿Podrías presentarte?",
                "¿Podrías decirme quién eres?",
                "¿Cómo te conocen?"
            ],
            "responses": [
                "Mi nombre es KAREN. Soy un chatbot diseñado para ayudarte en lo que necesites.",
                "Me llamo KAREN. Soy un asistente virtual creado para ayudarte en lo que necesites.",
                "Puedes llamarme KAREN, un chatbot diseñado para brindarte información y asistencia.",
                "Soy KAREN, un bot de inteligencia artificial creado para ayudarte en lo que necesites.",
                "Mi nombre es KAREN y estoy aquí para ayudarte. ¿En qué puedo ayudarte hoy?",
                "Soy KAREN, un bot diseñado para ayudarte. ¿En qué puedo ayudarte hoy?",
                "Puedes llamarme KAREN. ¿En qué puedo ayudarte hoy?",
                "Soy KAREN, un chatbot creado para brindarte información y asistencia. ¿En qué puedo ayudarte hoy?",
                "Me llaman KAREN, un asistente virtual diseñado para ayudarte. ¿En qué puedo ayudarte hoy?",
                "Mi nombre es KAREN. ¿En qué puedo ayudarte hoy?"
            ]
        },
        {
            "tag": "Cuidado de la ropa",
            "patterns": [
                "¿Cómo puedo cuidar mi ropa?",
                "¿Qué cuidados necesita mi ropa?",
                "¿Cómo debo lavar mi ropa?"
            ],
            "responses": [
                "Recomendamos leer las etiquetas de cuidado de cada prenda antes de lavarla. En general, se recomienda lavar a mano o en lavadora con agua fría y secar al aire libre o en secadora a baja temperatura.",
                "Es importante evitar el uso de lejía o planchar la ropa a altas temperaturas para evitar dañar las fibras.",
                "Si tiene alguna pregunta específica sobre el cuidado de una prenda, no dude en ponerse en contacto con nosotros para obtener más información."
            ]
        },
        {
            "tag": "Cuidado de la ropa",
            "patterns": [
                "¿Cómo puedo cuidar mi ropa?",
                "¿Qué cuidados necesita mi ropa?",
                "¿Cómo debo lavar mi ropa?"
            ],
            "responses": [
                "Recomendamos leer las etiquetas de cuidado de cada prenda antes de lavarla. En general, se recomienda lavar a mano o en lavadora con agua fría y secar al aire libre o en secadora a baja temperatura.",
                "Es importante evitar el uso de lejía o planchar la ropa a altas temperaturas para evitar dañar las fibras.",
                "Si tiene alguna pregunta específica sobre el cuidado de una prenda, no dude en ponerse en contacto con nosotros para obtener más información."
            ]
        },
        {
            "tag": "Combinación de ropa",
            "patterns": [
                "¿Cómo puedo combinar mi ropa?",
                "¿Qué colores combinan bien?",
                "¿Qué ropa puedo usar con estos pantalones?",
                "¿Cómo puedo hacer que mi ropa se vea bien juntos?"
            ],
            "responses": [
                "Recomendamos experimentar con diferentes combinaciones de ropa para encontrar su propio estilo único. En general, se pueden combinar colores opuestos en la rueda de colores o elegir un color predominante y combinarlo con tonos más claros o más oscuros.",
                "Para combinar pantalones, recomendamos elegir una camisa que contraste ",
                "Para combinar pantalones, recomendamos elegir una camisa que contraste ",
                "Para combinar pantalones, recomendamos elegir una camisa que contraste "
            ]
        },
        {
            "tag": "productos",
            "patterns": [
                "¿Qué tipo de ropa a crochet ofrecen?",
                "¿Cuáles son sus productos?",
                "¿Qué tienen de venta?",
                "¿Qué artículos de ropa tienen disponibles?",
                "¿Qué prendas a crochet venden?",
                "¿Qué puedo comprar en su tienda de ropa a crochet?",
                "¿Qué productos de vestir venden?",
                "¿Cuál es su selección de ropa a crochet?",
                "¿Tienen ropa a crochet de temporada?",
                "¿Tienen ropa a crochet para todas las edades?"
            ],
            "responses": [
                "Ofrecemos una gran variedad de ropa a crochet, como suéteres, chaquetas, chalecos, blusas, vestidos, pantalones, gorros, bufandas, accesorios y más.",
                "En nuestra tienda encontrarás una amplia selección de ropa a crochet para todas las edades y estilos, incluyendo suéteres, chalecos, blusas, vestidos, pantalones, gorros, bufandas, accesorios y más.",
                "Tenemos una amplia selección de ropa a crochet, incluyendo suéteres, chaquetas, chalecos, blusas, vestidos, pantalones, gorros, bufandas, accesorios y más. ¡Ven a explorar nuestra tienda en línea o visítanos en persona!",
                "Tenemos una amplia selección de ropa a crochet, incluyendo suéteres, chaquetas, chalecos, blusas, vestidos, pantalones, gorros, bufandas, accesorios y más. ¡Ven a explorar nuestra tienda en línea o visítanos en persona!",
                "Tenemos una amplia selección de ropa a crochet, incluyendo suéteres, chaquetas, chalecos, blusas, vestidos, pantalones, gorros, bufandas, accesorios y más. ¡Ven a explorar nuestra tienda en línea o visítanos en persona!",            
                "Tenemos una amplia selección de ropa a crochet, incluyendo suéteres, chaquetas, chalecos, blusas, vestidos, pantalones, gorros, bufandas, accesorios y más. ¡Ven a explorar nuestra tienda en línea o visítanos en persona!",            
                "Tenemos una amplia selección de ropa a crochet, incluyendo suéteres, chaquetas, chalecos, blusas, vestidos, pantalones, gorros, bufandas, accesorios y más. ¡Ven a explorar nuestra tienda en línea o visítanos en persona!",            
                "Tenemos una amplia selección de ropa a crochet, incluyendo suéteres, chaquetas, chalecos, blusas, vestidos, pantalones, gorros, bufandas, accesorios y más. ¡Ven a explorar nuestra tienda en línea o visítanos en persona!",            
                "Tenemos una amplia selección de ropa a crochet, incluyendo suéteres, chaquetas, chalecos, blusas, vestidos, pantalones, gorros, bufandas, accesorios y más. ¡Ven a explorar nuestra tienda en línea o visítanos en persona!",            
                "Tenemos una amplia selección de ropa a crochet, incluyendo suéteres, chaquetas, chalecos, blusas, vestidos, pantalones, gorros, bufandas, accesorios y más. ¡Ven a explorar nuestra tienda en línea o visítanos en persona!"                     
                ]
            },
        {
            "tag": "colores",
            "patterns": [
                "¿Tienen un color en particular?",
                "¿Tienen mi color favorito?",
                "¿Qué colores tienen disponibles?",
                "¿Qué tonalidades tienen de ropa a crochet?",
                "¿Tienen colores neutros en ropa a crochet?",
                "¿Cuáles son los colores más populares en ropa a crochet?",
                "¿Tienen ropa a crochet de colores brillantes?",
                "¿Tienen ropa a crochet con tonalidades pastel?",
                "¿Tienen ropa a crochet con tonalidades vibrantes?",
                "¿Puedo hacer un pedido de ropa a crochet en un color personalizado?"
            ],
            "responses": [
                "Tenemos una gran variedad de colores disponibles en ropa a crochet, desde tonalidades neutras hasta tonalidades brillantes y vibrantes. Por favor contáctanos para verificar si tenemos el color que necesita.",
                "Ofrecemos una amplia selección de tonalidades en ropa a crochet, desde tonos pastel hasta tonalidades brillantes y vibrantes. ¡Explora nuestra tienda para ver todas las opciones!",
                "En nuestra tienda encontrarás una amplia selección de colores en ropa a crochet, desde tonalidades neutras hasta tonalidades brillantes y vibrantes. Si no ves el color que buscas, contáctanos y haremos todo lo posible para ayudarte.",
                "Ofrecemos una amplia selección de tonalidades en ropa a crochet, desde tonos pastel hasta tonalidades brillantes y vibrantes. ¡Explora nuestra tienda para ver todas las opciones!",
                "Ofrecemos una amplia selección de tonalidades en ropa a crochet, desde tonos pastel hasta tonalidades brillantes y vibrantes. ¡Explora nuestra tienda para ver todas las opciones!",
                "Ofrecemos una amplia selección de tonalidades en ropa a crochet, desde tonos pastel hasta tonalidades brillantes y vibrantes. ¡Explora nuestra tienda para ver todas las opciones!",
                "Ofrecemos una amplia selección de tonalidades en ropa a crochet, desde tonos pastel hasta tonalidades brillantes y vibrantes. ¡Explora nuestra tienda para ver todas las opciones!",
                "Ofrecemos una amplia selección de tonalidades en ropa a crochet, desde tonos pastel hasta tonalidades brillantes y vibrantes. ¡Explora nuestra tienda para ver todas las opciones!",
                "Ofrecemos una amplia selección de tonalidades en ropa a crochet, desde tonos pastel hasta tonalidades brillantes y vibrantes. ¡Explora nuestra tienda para ver todas las opciones!",
                "Ofrecemos una amplia selección de tonalidades en ropa a crochet, desde tonos pastel hasta tonalidades brillantes y vibrantes. ¡Explora nuestra tienda para ver todas las opciones!"

            ]
        },
        {
            "tag": "tallas",
            "patterns": [
                "¿Qué tallas tienen disponibles?",
                "¿Tienen mi talla?",
                "¿En qué tallas tienen este producto?",
                "¿Puedo encontrar ropa de talla grande?",
                "¿Tienen tallas para niños?",
                "¿Tienen tallas para bebés?",
                "¿Cuáles son las medidas para cada talla?",
                "¿Cómo puedo saber mi talla?",
                "¿Tienen ropa para personas muy altas o muy bajas?",
                "¿Tienen tallas para personas con sobrepeso?"
            ],
            "responses": [
                "Tenemos una amplia variedad de tallas, desde la XS hasta la XXL. Por favor, contáctenos si necesita ayuda para encontrar su talla.",
                "Sí, tenemos una gran variedad de tallas disponibles. Por favor, contáctenos para verificar si tenemos la talla que necesita.",
                "Este producto está disponible en tallas desde la XS hasta la XXL.",
                "Sí, tenemos ropa en tallas grandes para mujeres y hombres.",
                "Sí, también tenemos ropa para niños en diferentes tallas.",
                "Sí, también tenemos ropa para bebés en diferentes tallas.",
                "Puede encontrar las medidas detalladas de cada talla en nuestra página web o tienda en línea.",
                "Para encontrar su talla, puede consultar nuestra guía de tallas en la página del producto o contáctenos para obtener asesoramiento.",
                "Sí, también tenemos tallas para personas altas y bajas. Por favor, contáctenos para más información.",
                "Sí, también tenemos tallas para personas con sobrepeso. Por favor, contáctenos para más información."
            ]
        },
        {
            "tag": "material",
            "patterns": [
              "¿De qué material están hechas?",
              "¿Qué tipo de hilo utilizan?",
              "¿Puedes hacerlas con otro material?"
            ],
            "responses": [
              "Utilizamos hilo de algodón de alta calidad para nuestras prendas. Si desea una prenda con otro material, por favor contáctenos para ver si es posible.",
              "Nuestras prendas están hechas con hilo de algodón mercerizado, lo que les da un brillo y suavidad especiales.",
              "Podemos hacer prendas de crochet con otros materiales, como lana o hilo acrílico. Por favor contáctenos para ver si es posible y para obtener un presupuesto."
            ]
          },
          {
            "tag": "tiempo-produccion",
            "patterns": [
              "¿Cuánto tiempo toma hacer una prenda?",
              "¿Cuánto tiempo tarda en entregarse una prenda?",
              "¿Cuál es el tiempo de producción?"
            ],
            "responses": [
              "El tiempo de producción depende del tipo de prenda y del tamaño. Por lo general, toma de 2 a 3 semanas. Por favor contáctenos para obtener una estimación más precisa.",
              "El tiempo de entrega varía según el lugar de envío. En promedio, toma de 1 a 2 semanas después de la finalización de la prenda. ",
              "El tiempo de producción puede variar según la complejidad de la prenda y la cantidad de pedidos que tengamos. Si necesita una prenda en particular para una fecha determinada, por favor contáctenos con anticipación."
            ]
          },
          {
            "tag": "garantia",
            "patterns": [
              "¿Ofrecen garantía en sus productos?",
              "¿Qué pasa si la prenda no se ajusta correctamente?",
              "¿Qué sucede si la prenda se daña después de su compra?"
            ],
            "responses": [
              "Ofrecemos una garantía de satisfacción del 100% en todos nuestros productos. Si no está satisfecho con su compra, contáctenos para obtener una solución.",
              "Si la prenda no se ajusta correctamente, podemos hacerle ajustes o reemplazarla si es necesario. Por favor contáctenos para obtener más información.",
              "Si la prenda se daña después de su compra, contáctenos para ver si es posible repararla o reemplazarla. Por favor, tenga en cuenta que las prendas dañadas por mal uso no están cubiertas por la garantía."
            ]
          },
          {
            "tag": "envio",
            "patterns": [
              "¿Cuál es el costo de envío?",
              "¿Hacen envíos internacionales?",
              "¿Cuánto tiempo toma el envío?"
            ],
            "responses": [
              "El costo de envío varía según el lugar de destino y el tamaño del paquete. Por favor contáctenos para obtener más información.",
              "Sí, hacemos envíos internacionales. Por favor contáctenos para obtener más información sobre los costos y plazos de envío.",
              "El tiempo de envío varía según el lugar de destino y el tipo de envío seleccionado. Por lo general, toma de 1 a 2 semanas."
            ]
        },
        {
            "tag": "ocasion",
            "patterns": [
              "Son apropiadas para una ocasión especial?",
              "Podría usarla para un evento formal?",
              "Estas prendas son para uso diario o para ocasiones especiales?"
            ],
            "responses": [
              "Nuestras prendas son muy versátiles y pueden ser utilizadas para una variedad de ocasiones, desde eventos formales hasta uso diario.",
              "Sí, nuestras prendas son perfectas para ocasiones especiales. Tenemos una variedad de estilos y colores que se adaptan a cualquier evento.",
              "Nuestras prendas son adecuadas tanto para uso diario como para ocasiones especiales. Depende del estilo y color que elija."
            ]
          },
          {
            "tag": "comisiones",
            "patterns": [
              "Aceptan encargos personalizados?",
              "Pueden hacer una prenda de mi diseño personalizado?",
              "Cómo puedo solicitar una prenda personalizada?"
            ],
            "responses": [
              "Sí, aceptamos encargos personalizados. Contáctenos para discutir los detalles de su pedido.",
              "Por supuesto, podemos hacer una prenda personalizada para usted. Por favor, envíenos su diseño y discutiremos los detalles.",
              "Puede solicitar una prenda personalizada enviándonos un mensaje con los detalles de su diseño. Le proporcionaremos un presupuesto y un tiempo estimado de entrega."
            ]
          },
          {
            "tag": "cuidado",
            "patterns": [
              "Cómo debo cuidar mis prendas de crochet?",
              "Puedo lavarlas en la lavadora?",
              "Requieren cuidados especiales?"
            ],
            "responses": [
              "Recomendamos lavar las prendas a mano con agua fría y secarlas en plano. No utilice secadora ni plancha.",
              "No recomendamos lavar las prendas en la lavadora, ya que pueden dañarse. Lave a mano con agua fría y secar en plano.",
              "Las prendas de crochet requieren cuidados especiales para mantener su forma y calidad. Recomendamos lavar a mano con agua fría y secar en plano. No utilice secadora ni plancha."
            ]
          },
          {
            "tag": "tiempo",
            "patterns": [
                "Cuánto tiempo tardan en hacer un producto?",
                "Cuánto tiempo se tarda en recibir el producto?",
                "Cuánto tiempo tardan en enviar el producto?",
                "Cuál es el tiempo de entrega?",
                "Cuánto tarda en llegar el producto?",
                "Pueden hacer una entrega urgente?",
                "Tienen opciones de envío exprés?",
                "Cuánto tiempo demora el envío internacional?",
                "El envío es gratis?",
                "Qué opciones de envío ofrecen?"
            ],
            "responses": [
                "El tiempo de producción y envío varía dependiendo del producto y la ubicación. Por favor contáctanos para obtener una estimación más precisa.",
                "El tiempo de entrega varía según la ubicación y el método de envío seleccionado. Por favor contáctanos para obtener una estimación más precisa.",
                "Nos esforzamos por enviar los productos lo más rápido posible, generalmente dentro de los 3 días hábiles posteriores a la compra. El tiempo de entrega varía según la ubicación y el método de envío seleccionado. Por favor contáctanos para obtener una estimación más precisa.",
                "El tiempo de entrega varía según la ubicación y el método de envío seleccionado. Por favor contáctanos para obtener una estimación más precisa.",
                "El tiempo de entrega varía según la ubicación y el método de envío seleccionado. Por favor contáctanos para obtener una estimación más precisa.",
                "Podemos ofrecer opciones de envío urgente para entregas en el mismo día o al día siguiente en algunas áreas. Por favor contáctanos para verificar la disponibilidad y los precios.",
                "Ofrecemos opciones de envío exprés para entregas más rápidas. Por favor contáctanos para obtener más información y precios.",
                "El tiempo de envío internacional varía según la ubicación y el método de envío seleccionado. Por favor contáctanos para obtener una estimación más precisa.",
                "El envío es gratuito para pedidos superiores a un cierto monto. Por favor contáctanos para obtener más información.",
                "Ofrecemos opciones de envío estándar y exprés. Por favor contáctanos para obtener más información sobre los métodos de envío y precios."
            ]
        },
        {
            "tag": "estilos",
            "patterns": [
                "Qué tipo de estilo manejan?",
                "Tienen prendas para un estilo casual?",
                "Busco ropa con estilo boho chic, qué tienen?"
            ],
            "responses": [
                "Manejamos una gran variedad de estilos, desde casuales hasta formales. Tenemos algunas prendas con estilo boho chic, por favor contáctanos para más información.",
                "Todas nuestras prendas son muy versátiles y pueden ser utilizadas para una variedad de ocasiones, desde eventos formales hasta uso diario.",
                "no creo disponer de ropa estilo boho"
            ]
        },
        {
            "tag": "especial",
            "patterns": [
                "Busco un outfit para una ocasión especial, me pueden ayudar?",
                "Qué prendas recomiendan para una cena formal?",
                "Qué tipo de ropa es apropiada para un evento de gala?"
            ],
            "responses": [
                "Podemos ayudarte a encontrar el outfit perfecto para cualquier ocasión especial. Para una cena formal recomendamos prendas elegantes y sofisticadas, mientras que para un evento de gala es recomendable usar trajes de noche y vestidos de gala.",
                "te recomiendo utilizar un vestido a crochet, es muy elegante y sofisticado",
                "blusas a crochet o vestidos a crochet son muy bonitos para una cena formal"

            ]
        },
        {
            "tag": "playa",
            "patterns": [
                "Tienen ropa para usar en la playa?",
                "Qué tipo de prendas son cómodas para la playa?",
                "Necesito ropa fresca para un viaje a la playa, qué me recomiendan?"
            ],
            "responses": [
                "Tenemos una selección de ropa perfecta para usar en la playa, como vestidos frescos, shorts y blusas de algodón. Todo lo que necesitas para mantenerte cómoda y fresca durante tus vacaciones.",
                "En nuestra web encontraras modelos bonitos para playa",
                "en nuestra web existe modelos frescos para andar en la playa"
            ]
        },
        {
            "tag": "yoga",
            "patterns": [
                "Tienen ropa para yoga?",
                "Qué tipo de ropa es apropiada para hacer yoga?",
                "Necesito un outfit cómodo para practicar yoga, qué me recomiendan?"
            ],
            "responses": [
                "Tenemos una selección de ropa cómoda y elástica perfecta para practicar yoga, como leggings, tops y shorts. Todo lo que necesitas para moverte libremente y concentrarte en tu práctica.",
                "Tenemos una selección de ropa para practicar yoga, como leggings, tops y shorts. Todo lo que necesitas para moverte libremente y concentrarte en tu práctica.",
                "Tenemos una selección perfecta para practicar yoga, como leggings, tops y shorts. Todo lo que necesitas para moverte libremente y concentrarte en tu práctica."

            ]
        },
        {
            "tag": "fitness",
            "patterns": [
                "Tienen ropa para hacer ejercicio?",
                "Qué tipo de prendas son apropiadas para hacer fitness?",
                "Busco un outfit cómodo para hacer ejercicios de alto impacto, qué me recomiendan?"
            ],
            "responses": [
                "Tenemos una selección de ropa deportiva diseñada para hacer ejercicios de alta intensidad, como leggings, tops deportivos y sudaderas con capucha. Todo lo que necesitas para mantenerte cómoda y motivada durante tu entrenamiento.",
                "Tenemos una selección de ropa para hacer fitness diseñada para hacer ejercicios de alta intensidad, como leggings, tops deportivos y sudaderas con capucha. Todo lo que necesitas para mantenerte cómoda y motivada durante tu entrenamiento.",
                "Tenemos una selección de ropa cómoda diseñada para hacer ejercicios de alta intensidad, como leggings, tops deportivos y sudaderas con capucha. Todo lo que necesitas para mantenerte cómoda y motivada durante tu entrenamiento."
            ]
        },
        {
            "tag": "color",
            "patterns": [
                "¿Qué colores tienes?",
                "¿Tienen este producto en otro color?",
                "¿Hay una opción para personalizar el color?"
            ],
            "responses": [
                "Ofrecemos una variedad de colores para nuestros productos. Por favor, visite nuestra página de productos para ver las opciones de colores disponibles.",
                "Podemos personalizar el color de ciertos productos para satisfacer sus necesidades. Por favor contáctanos para más información.",
                "Nuestros productos vienen en una variedad de colores estándar. Si está buscando un color en particular, háganoslo saber y haremos todo lo posible para ayudarlo."
            ]
        },
        {
            "tag": "tamaño",
            "patterns": [
                "¿Qué tamaños tienes disponibles?",
                "¿Puedo obtener este producto en otro tamaño?",
                "¿Hay una opción para personalizar el tamaño?"
            ],
            "responses": [
                "Ofrecemos una variedad de tamaños para nuestros productos. Por favor, visite nuestra página de productos para ver las opciones de tamaño disponibles.",
                "Podemos personalizar el tamaño de ciertos productos para satisfacer sus necesidades. Por favor contáctanos para más información.",
                "Nuestros productos vienen en una variedad de tamaños estándar. Si está buscando un tamaño en particular, háganoslo saber y haremos todo lo posible para ayudarlo."
            ]
        },
        {
            "tag": "precio",
            "patterns": [
                "¿Cuánto cuesta?",
                "¿Tienes algún descuento?",
                "¿Puedes hacer un precio especial?"
            ],
            "responses": [
                "Nuestros precios son competitivos y varían según el producto. Por favor, visite nuestra página de productos para obtener información detallada sobre los precios.",
                "Ofrecemos descuentos y promociones especiales de vez en cuando. Por favor, visite nuestra página de promociones o contáctanos para obtener más información.",
                "Podemos ofrecer precios especiales en algunos casos. Por favor contáctanos para más información."
            ]
        },
        {
            "tag": "devolución",
            "patterns": [
                "¿Qué pasa si quiero devolver un producto?",
                "¿Cuál es su política de devolución?",
                "¿Ofrecen garantía?"
            ],
            "responses": [
                "Si desea devolver un producto, por favor contáctenos para obtener más información sobre nuestra política de devolución.",
                "Nuestra política de devolución varía según el producto. Por favor, visite nuestra página de devolución para obtener información detallada.",
                "Sí, ofrecemos garantía para algunos productos. Por favor, visite nuestra página de garantía para obtener información detallada."
            ]
        },
        {
            "tag": "compra",
            "patterns": [
                "¿Cómo puedo hacer una compra?",
                "¿Aceptan tarjetas de crédito?",
                "¿Puedo hacer una compra por teléfono?"
            ],
            "responses": [
                "Puede hacer una compra en línea a través de nuestro sitio web o puede visitarnos en nuestra tienda física.",
                "Sí, aceptamos tarjetas de crédito. También aceptamos otras formas de pago, como PayPal.",
                "Sí, puede hacer una compra por teléfono. Por favor, contáctanos para más información."
            ]
        }
    ]
}