{
    "intents": [
        {
            "tag": "productos1",
            "patterns": [
                "Que tipo de ropa ofrecen?",
                "Cuales son sus productos?",
                "Que tienen de venta?"
            ],
            "responses": [
                "Ofrecemos una gran variedad de ropa para hombres, mujeres y ninos, incluyendo camisetas, pantalones, vestidos, sueteres, chaquetas y accesorios."
            ]
        },
        {
            "tag": "descuentos2",
            "patterns": [
                "Tienen algun descuento?",
                "Ofrecen promociones?",
                "Tienen alguna oferta?"
            ],
            "responses": [
                "Si, actualmente tenemos una promocion del 20% en toda nuestra ropa de verano."
            ]
        },
        {
            "tag": "envios3",
            "patterns": [
                "Como puedo hacer un pedido?",
                "Como hago para comprar?",
                "Como se hacen los envios?"
            ],
            "responses": [
                "Puede hacer un pedido a traves de nuestra pagina web o visitando nuestra tienda en linea. Ofrecemos envios a todas partes de Ecuador."
            ]
        },
        {
            "tag": "devoluciones4",
            "patterns": [
                "Como puedo devolver un producto?",
                "Tienen politicas de devolucion?",
                "Que pasa si no estoy satisfecho con mi compra?"
            ],
            "responses": [
                "Ofrecemos devoluciones dentro de los primeros 14 dias despues de la compra. Por favor, contactenos para obtener mas informacion sobre nuestras politicas."
            ]
        },
        {
            "tag": "nuevos productos5",
            "patterns": [
                "Tienen nuevos productos?",
                "Hay algo nuevo en su tienda?",
                "Hay alguna novedad?"
            ],
            "responses": [
                "Sí, siempre estamos actualizando nuestra tienda con nuevos productos, visita nuestra pagina web para ver las ultimas novedades."
            ]
        },
        {
            "tag": "tallas6",
            "patterns": [
                "Tienen una talla en especifico?",
                "Tienen mi talla?",
                "Que tallas tienen disponibles?"
            ],
            "responses": [
                "Tenemos una gran variedad de tallas disponibles, por favor contáctanos para verificar si tenemos la talla que necesita."
            ]
        },
        {
            "tag": "color7",
            "patterns": [
                "Tienen un color en especifico?",
                "Tienen mi color favorito?",
                "Que colores tienen disponibles?"
            ],
            "responses": [
                "Tenemos una gran variedad de colores disponibles, por favor contáctanos para verificar si tenemos el color que necesita."
            ]
        },
        {
            "tag": "precios8",
            "patterns": [
                "Cuál es el precio?",
                "Cuánto cuesta?",
                "Hay precios especiales?"
            ],
            "responses": [
                "Los precios varían dependiendo del producto, por favor visita nuestra página web o tienda en línea para ver los precios actuales."
            ]
        },
        {
            "tag": "pagos9",
            "patterns": [
                "Cómo puedo pagar?",
                "Qué formas de pago aceptan?",
                "Aceptan tarjetas de crédito?"
            ],
            "responses": [
                "Aceptamos pagos a través de tarjeta de crédito, débito, PayPal y transferencia bancaria."
            ]
        },
        {
            "tag": "horarios10",
            "patterns": [
                "Cuáles son sus horarios?",
                "Están abiertos ahora?",
                "Cuándo cierran?"
            ],
            "responses": [
                "Nuestros horarios de atención son de lunes a viernes de 9am a 6pm, y los sábados de 9am a 2pm. Estamos cerrados los domingos."
            ]
        },
        {
            "tag": "ubicacion11",
            "patterns": [
                "Dónde están ubicados?",
                "Cómo llegar a su tienda?",
                "Tienen dirección?"
            ],
            "responses": [
                "Nuestra tienda se encuentra en tal dirección, estamos disponible para indicarle como llegar desde su ubicación actual"
            ]
        },
        {
            "tag": "nuevos productos5",
            "patterns": [
                "Tienen nuevos productos?",
                "Hay algo nuevo en su tienda?",
                "Hay alguna novedad?"
            ],
            "responses": [
                "Sí, siempre estamos actualizando nuestra tienda con nuevos productos, visita nuestra pagina web para ver las ultimas novedades."
            ]
        },
        {
            "tag": "tallas6",
            "patterns": [
                "Tienen una talla en especifico?",
                "Tienen mi talla?",
                "Que tallas tienen disponibles?"
            ],
            "responses": [
                "Tenemos una gran variedad de tallas disponibles, por favor contáctanos para verificar si tenemos la talla que necesita."
            ]
        },
        {
            "tag": "color7",
            "patterns": [
                "Tienen un color en especifico?",
                "Tienen mi color favorito?",
                "Que colores tienen disponibles?"
            ],
            "responses": [
                "Tenemos una gran variedad de colores disponibles, por favor contáctanos para verificar si tenemos el color que necesita."
            ]
        },
        {
            "tag": "precios8",
            "patterns": [
                "Cuál es el precio?",
                "Cuánto cuesta?",
                "Hay precios especiales?"
            ],
            "responses": [
                "Los precios varían dependiendo del producto, por favor visita nuestra página web o tienda en línea para ver los precios actuales."
            ]
        },
        {
            "tag": "pagos9",
            "patterns": [
                "Cómo puedo pagar?",
                "Qué formas de pago aceptan?",
                "Aceptan tarjetas de crédito?"
            ],
            "responses": [
                "Aceptamos pagos a través de tarjeta de crédito, débito, PayPal y transferencia bancaria."
            ]
        },
        {
            "tag": "horarios10",
            "patterns": [
                "Cuáles son sus horarios?",
                "Están abiertos ahora?",
                "Cuándo cierran?"
            ],
            "responses": [
                "Nuestros horarios de atención son de lunes a viernes de 9am a 6pm, y los sábados de 9am a 2pm. Estamos cerrados los domingos."
            ]
        },
        {
            "tag": "ubicacion11",
            "patterns": [
                "Dónde están ubicados?",
                "Cómo llegar a su tienda?",
                "Tienen dirección?"
            ],
            "responses": [
                "Nuestra tienda se encuentra en tal dirección, estamos disponible para indicarle como llegar desde su ubicación actual"
            ]
        },
        {
            "tag": "atencion12",
            "patterns": [
                "Cómo puedo contactarlos?",
                "Tienen teléfono?",
                "Tienen servicio al cliente?"
            ],
            "responses": [
                "Sí, tenemos servicio al cliente disponible a través de nuestro número de teléfono 123-456-7890 y también puede contactarnos a través de nuestro correo electrónico info@tienda.com."
            ]
        },
        {
            "tag": "surtido13",
            "patterns": [
                "Tienen una gran variedad de ropa?",
                "Tienen un surtido amplio?",
                "Tienen una gran selección?"
            ],
            "responses": [
                "Sí, tenemos una gran variedad de ropa para todas las edades y gustos, estamos seguros de que encontrará algo que le guste."
            ]
        },
        {
            "tag": "personalizacion14",
            "patterns": [
                "Ofrecen ropa personalizada?",
                "Puedo personalizar mi ropa?",
                "Ofrecen servicios de bordado?"
            ],
            "responses": [
                "Sí, ofrecemos servicios de personalización, como bordado y estampado. Por favor contáctanos para obtener más información sobre estos servicios."
            ]
        },
        {
            "tag": "saludo1",
            "patterns": [
                "Hola",
                "Buenos días",
                "Buenas tardes"
            ],
            "responses": [
                "Hola, ¿en qué puedo ayudarte hoy?",
                "Buenos días, ¿cómo puedo ayudarte?",
                "Buenas tardes, ¿en qué puedo ayudarte?"
            ]
        },
        {
            "tag": "presentacion2",
            "patterns": [
                "¿Quién es usted?",
                "¿Cómo se llama?",
                "¿Puede presentarse?"
            ],
            "responses": [
                "Soy un asistente virtual de ventas de ropa, ¿en qué puedo ayudarte?",
                "Mi nombre es Karen, ¿cómo puedo ayudarte?",
                "Soy un representante de ventas, ¿en qué puedo ayudarte?"
            ]
        },
        {
            "tag": "ayuda3",
            "patterns": [
                "Necesito ayuda",
                "No entiendo",
                "No sé cómo hacerlo"
            ],
            "responses": [
                "Claro, ¿en qué puedo ayudarte?",
                "¿En qué necesitas ayuda?",
                "Estoy aquí para ayudarte, ¿en qué puedo ayudarte?"
            ]
        },
        {
            "tag": "informacion4",
            "patterns": [
                "Necesito más información",
                "Quiero saber más",
                "¿Puede darme más detalles?"
            ],
            "responses": [
                "Claro, ¿sobre qué necesitas más información?",
                "¿En qué puedo ayudarte con información adicional?",
                "Estoy aquí para proporcionarte toda la información que necesites, ¿sobre qué estas interesado?"
            ]
        },
        {
            "tag": "dudas5",
            "patterns": [
                "Tengo dudas",
                "No estoy seguro",
                "No estoy convencido"
            ],
            "responses": [
                "Entiendo, ¿en qué puedo ayudarte a aclarar tus dudas?",
                "¿Qué dudas tienes? Estoy aquí para ayudarte.",
                "Claro, ¿Qué es lo que te hace tener dudas? estaré encantado de ayudarte a aclararlas."
            ]
        },
        {
            "tag": "bienvenida6",
            "patterns": [
                "Buenas",
                "Que tal",
                "Hola"
            ],
            "responses": [
                "¿en qué puedo ayudarte?",
                "Estoy contento de poder ayudarte, ¿en qué necesitas ayuda?",
                "¡Hola! ¿En qué puedo ayudarte hoy?"
            ]
        },
        {
            "tag": "interes7",
            "patterns": [
                "Estoy interesado",
                "Me gustaría saber más",
                "Me interesa"
            ],
            "responses": [
                "¡Genial! ¿En qué producto o servicio estás interesado?",
                "Estoy emocionado de poder ayudarte, ¿puedes proporcionarme más detalles sobre tu interés?",
                "Me alegro de saber que estás interesado, ¿en qué puedo ayudarte?"
            ]
        },
        {
            "tag": "busqueda8",
            "patterns": [
                "Estoy buscando",
                "Quiero comprar",
                "Necesito"
            ],
            "responses": [
                "¡Entiendo! ¿Qué estás buscando comprar?",
                "¡Claro! ¿En qué puedo ayudarte a encontrar lo que necesitas?",
                "¡Perfecto! ¿Qué es lo que necesitas comprar?"
            ]
        },
        {
            "tag": "opciones9",
            "patterns": [
                "¿Qué opciones tienen?",
                "¿Qué puedo elegir?",
                "¿Qué me recomiendas?"
            ],
            "responses": [
                "Tenemos una gran variedad de opciones disponibles, ¿enqué categoria estas interesado? estaré encantado de mostrarte nuestras opciones disponibles.",
                "Tenemos una amplia selección de productos, ¿en qué estas interesado? estaré feliz de mostrarte las opciones que tenemos.",
                "Tenemos varias opciones disponibles, ¿en qué categoría estás interesado? Estaré encantado de recomendarte algunas opciones."
            ]
        },
        {
            "tag": "metodosEnvioDomicilio",
            "patterns": [
                "Cómo puedo recibir mi pedido?",
                "Cómo hago para que me lo envíen a mi casa?",
                "Qué opciones de envío a domicilio tienen?",
                "Cuáles son los costos de envío a mi dirección?"
            ],
            "responses": [
                "Ofrecemos envío a domicilio a través de diferentes servicios de paquetería, con precios y tiempos de entrega variados dependiendo de su ubicación. Por favor proporcione su dirección para brindarle una cotización precisa",
                "Podemos enviar su pedido directamente a su dirección de envío. Los costos de envío pueden variar según su ubicación y el servicio de paquetería que elija. ¿Podría proporcionarme su dirección para brindarle una cotización precisa?",
                "Ofrecemos envíos a domicilio a través de diferentes servicios de paquetería con precios y tiempos de entrega variados dependiendo de su ubicación, ¿podría proporcionarme su dirección para brindarle una cotización precisa?"
            ]
        },
        {
            "tag": "comprarRopa",
            "patterns": [
                "Cómo puedo comprar ropa?",
                "Cómo hago un pedido?",
                "Cómo se hacen las compras?",
                "Puedo comprar en línea?"
            ],
            "responses": [
                "Sí, puede comprar en línea a través de nuestra página web o tienda en línea. Puede seleccionar los productos que desea, agregarlos al carrito de compras y seguir las instrucciones para completar la compra. También puede visitar nuestra tienda física para hacer una compra en persona",
                "Ofrecemos varias opciones para comprar ropa, incluyendo nuestra tienda en línea o visitando nuestra tienda física. Puede navegar por nuestros productos, seleccionar los que desee y seguir las instrucciones para completar su compra. ¿En qué le podemos ayudar?",
                "Puede comprar ropa en nuestra tienda en línea o visitando nuestra tienda física. En ambos casos, puede seleccionar los productos que desee, agregarlos al carrito de compras y seguir las instrucciones para completar la compra. Si tiene alguna pregunta durante el proceso, no dude en contactarnos para ayudarle."
            ]
        },
        {
            "tag": "consultarRopa",
            "patterns": [
                "Cómo puedo ver los productos?",
                "Dónde puedo ver la ropa?",
                "Cómo navegar por los productos?",
                "Dónde está la sección de ropa?"
            ],
            "responses": [
                "Puede ver nuestros productos en línea a través de nuestra página web o tienda en línea. Tenemos una sección de ropa donde puede navegar por diferentes categorías y al dar click vera a detalle la prenda y el precio respectivo. También puede visitar nuestra tienda física para ver los productos en persona",
                "Puede encontrar nuestros productos en línea en nuestra tienda en línea o visitando nuestra tienda física. En ambos casos, puede navegar por diferentes categorías de ropa y filtrar por talla, color y precio. ¿En qué le podemos ayudar?",
                "Nuestros productos están disponibles en línea en nuestra tienda en línea o en nuestra tienda física. Puede navegar por diferentes categorías de ropa, como camisetas, pantalones, vestidos, etc. Si tiene alguna pregunta, no dude en contactarnos."
            ]
        },
        {
            "tag": "usarPaginaWebRopa",
            "patterns": [
                "Cómo usar la página web?",
                "Cómo navegar por la tienda en línea?",
                "Cómo buscar productos?",
                "Cómo hacer un pedido en línea?"
            ],
            "responses": [
                "La navegación en nuestra página web es sencilla e intuitiva. Puede utilizar el menú de categorías para encontrar los productos que está buscando, utilizar el buscador para buscar productos específicos o navegar por las promociones en la página de inicio. Para hacer un pedido, agregue los productos deseados al carrito de compras y siga las instrucciones para completar la compra.",
                "Nuestra tienda en línea está diseñada para ser fácil de usar. Puede navegar por las diferentes categorías de ropa en el menú, utilizar el buscador para encontrar productos específicos o ver las promociones en la página de inicio. Una vez que haya encontrado el producto que desea, agregarlo al carrito y seguir las instrucciones para completar la compra.",
                "La página web está diseñada para ser fácil de usar. Puede navegar por las diferentes categorías de ropa, utilizar el buscador para encontrar productos específicos o ver las promociones en la página de inicio. Una vez que haya encontrado el producto deseado, agregarlo al carrito de compra y seguir las instrucciones para completar la compra. Si tiene alguna pregunta, no dude en contactarnos."
            ]
        },
        {
            "tag": "pagarConPaypal",
            "patterns": [
                "Cómo pagar con PayPal?",
                "Cómo usar PayPal en la compra?",
                "Cómo agregar PayPal como forma de pago?",
                "Cómo se hace un pago con PayPal?"
            ],
            "responses": [
                "Para pagar con PayPal, simplemente seleccione PayPal como forma de pago en el proceso de compra. Será redirigido a la página de PayPal donde podrá iniciar sesión en su cuenta y confirmar el pago. Una vez confirmado, regresará a nuestra página para completar la compra.",
                "PayPal es una opción de pago válida en nuestra tienda en línea. Durante el proceso de compra, simplemente seleccione PayPal como forma de pago y siga las instrucciones para iniciar sesión en su cuenta de PayPal y confirmar el pago. Una vez confirmado, regresará a nuestra página para completar la compra.",
                "Puede seleccionar PayPal como forma de pago durante el proceso de compra en nuestra tienda en línea. Será redirigido a la página de PayPal donde podrá iniciar sesión en su cuenta y confirmar el pago. Una vez confirmado, regresará a nuestra página para completar la compra."
            ]
        },
        {
            "tag": "otrosMetodosPago",
            "patterns": [
                "¿Aceptan otros métodos de pago?",
                "¿Tienen opciones adicionales de pago?",
                "¿Qué métodos de pago adicionales aceptan?",
                "¿Tienen tarjeta de crédito o débito como opción de pago?"
            ],
            "responses": [
                "Actualmente solo ofrecemos PayPal como opción de pago. Nos disculpamos por cualquier inconveniente esto pueda causar.",
                "Lo sentimos, solo aceptamos PayPal como forma de pago en este momento.",
                "Actualmente solo ofrecemos PayPal como opción de pago, lo sentimos si esto causa algún inconveniente.",
                "Actualmente solo aceptamos PayPal como forma de pago, disculpe las molestias."
            ]
        },
        {
            "tag": "catalogoProductos",
            "patterns": [
                "¿Tienen un catálogo de productos?",
                "¿Dónde puedo ver todos los productos?",
                "¿Puedo ver un listado de todos los productos?",
                "¿Tienen una lista de todos los productos disponibles?"
            ],
            "responses": [
                "Sí, tenemos un catálogo de productos en línea en nuestra página web donde puede navegar por diferentes categorías y ver todos nuestros productos disponibles.",
                "Puede ver todos nuestros productos disponibles en línea en nuestra página web, en la sección de productos.",
                "Sí, tenemos un catálogo completo de productos en línea en nuestra página web donde puede ver todos los productos disponibles y filtrarlos por categoría.",
                "Sí, tenemos una lista completa de todos los productos disponibles en línea en nuestra página web, en la sección de productos."
            ]
        },
        {
            "tag": "otrosModelosRopa",
            "patterns": [
                "¿Tienen otros modelos de este producto?",
                "¿Tienen esta prenda en otro color?",
                "¿Tienen esta prenda en otra talla?",
                "¿Tienen más opciones de este tipo de ropa?"
            ],
            "responses": [
                "Sí, tenemos otros modelos y opciones disponibles de este producto. Por favor visite nuestra página web o tienda física para ver nuestra selección completa.",
                "Sí, tenemos otros colores y tallas disponibles para este producto. Por favor visite nuestra página web o tienda física para ver todas las opciones.",
                "Sí, tenemos otras opciones y modelos disponibles de este tipo de ropa. Por favor visite nuestra página web o tienda física para ver nuestra selección completa.",
                "Sí, tenemos más opciones de este tipo de ropa disponibles. Por favor visite nuestra página web o tienda física para ver todas las opciones disponibles."
            ]
        },
        {
            "tag": "otrosColoresRopa",
            "patterns": [
                "¿Tienen este producto en otros colores?",
                "¿Tienen esta prenda en otro color?",
                "¿Hay más opciones de color para este producto?",
                "¿Qué otros colores tienen disponibles para este producto?"
            ],
            "responses": [
                "Sí, tenemos este producto disponible en otros colores. Por favor visite nuestra página web o tienda física para ver todas las opciones de color.",
                "Sí, tenemos esta prenda disponible en varios colores. Por favor visite nuestra página web o tienda física para ver todas las opciones.",
                "Sí, tenemos más opciones de color para este producto. Por favor visite nuestra página web o tienda física para ver todas las opciones disponibles.",
                "Actualmente ofrecemos este producto en varios colores, por favor visite nuestra página web o tienda física para ver todas las opciones disponibles."
            ]
        },
        {
            "tag": "materialRopa",
            "patterns": [
                "¿De qué está hecho este producto?",
                "¿Qué tipo de tela es esta prenda?",
                "¿Es esta ropa hecha de algodón?",
                "¿Qué material se utilizó para hacer esta ropa?"
            ],
            "responses": [
                "Este producto está hecho de lana. Es suave al tacto y cálido.",
                "Esta prenda está hecha de lana, es resistente y cálida al tacto.",
                "No, esta ropa no está hecha de algodón, esta hecha de lana.",
                "Este producto está hecho de lana, es suave y cálida al tacto, ideales para temperaturas frías."
            ]
        },
        {
            "tag": "materialRopa2",
            "patterns": [
                "¿De qué está fabricada esta ropa?",
                "¿Qué tipo de fibras se utilizaron para hacer esta prenda?",
                "¿Es esta ropa hecha de algún material sintético?",
                "¿Qué tipo de telas se utilizaron para hacer esta ropa?"
            ],
            "responses": [
                "Esta ropa está fabricada con lana, es suave al tacto y cálida.",
                "En esta prenda se utilizaron fibras de lana para su fabricación, es resistente y cálida al tacto.",
                "No, esta ropa no está hecha de materiales sintéticos, esta hecha de lana.",
                "Esta ropa está hecha con telas de lana, es suave y cálida al tacto, ideales para temperaturas frías."
            ]
        },
        {
            "tag": "tipoRopa",
            "patterns": [
                "¿Qué tipo de ropa venden?",
                "¿Qué especialidad tienen en su tienda?",
                "¿Qué tipo de prendas ofrecen?",
                "¿Qué productos se pueden encontrar en su tienda?"
            ],
            "responses": [
                "Vendemos ropa crochet hecha con lana, son suaves, cálidas y con diseños únicos.",
                "Nuestra especialidad son las prendas de ropa crochet hechas con lana, son suaves, cálidas y con diseños únicos.",
                "Ofrecemos ropa crochet hecha con lana, son suaves, cálidas y con diseños únicos.",
                "En nuestra tienda encontrará prendas de ropa crochet hechas con lana, son suaves, cálidas y con diseños únicos."
            ]
        },
        {
            "tag": "tipoRopa2",
            "patterns": [
                "¿Qué clase de ropa tienen en su tienda?",
                "¿Qué productos especiales ofrecen?",
                "¿Qué ropa se puede encontrar en su tienda?",
                "¿Qué tipo de prendas tienen disponibles?"
            ],
            "responses": [
                "En nuestra tienda ofrecemos ropa hecha a mano con crochet y lana, son suaves, cálidas y con diseños únicos.",
                "Nuestros productos especiales son prendas de ropa hechas a mano con crochet y lana, son suaves, cálidas y con diseños únicos.",
                "En nuestra tienda encontrará ropa hecha a mano con crochet y lana, son suaves, cálidas y con diseños únicos.",
                "Actualmente tenemos prendas de ropa hechas a mano con crochet y lana, son suaves, cálidas y con diseños únicos."
            ]
        },
        {
            "tag": "calidadRopa",
            "patterns": [
                "¿Qué calidad tienen sus productos?",
                "¿Son prendas de alta calidad?",
                "¿Cómo describiría la calidad de su ropa?",
                "¿La ropa es duradera?"
            ],
            "responses": [
                "Nuestros productos son de alta calidad, utilizamos los mejores materiales y técnicas para garantizar la durabilidad y comodidad de nuestras prendas.",
                "Sí, ofrecemos prendas de alta calidad, con telas y materiales de primera calidad.",
                "La calidad de nuestra ropa es excepcional, utilizamos los mejores materiales y técnicas para garantizar la durabilidad y comodidad de nuestras prendas.",
                "Sí, nuestras prendas son duraderas y confortables, ya que utilizamos materiales de alta calidad."
            ]
        },
        {
            "tag": "preciosRopa",
            "patterns": [
                "¿Cuáles son los precios de sus productos?",
                "¿Sus prendas son caras?",
                "¿Hay algún tipo de descuento en sus precios?",
                "¿Cómo compararías los precios de su ropa con otras tiendas?"
            ],
            "responses": [
                "Nuestros precios son competitivos en comparación con otras tiendas del mercado, tenemos opciones para diferentes presupuestos.",
                "No, nuestros precios son accesibles y competitivos con otras tiendas del mercado.",
                "Ofrecemos promociones y descuentos en diferentes productos y temporadas, por favor visite nuestra página web o tienda física para obtener más información.",
                "Nuestros precios son competitivos en comparación con otras tiendas del mercado, ofrecemos una gran variedad de productos y opciones para diferentes presupuestos."
            ]
        },
        {
            "tag": "servicioCliente",
            "patterns": [
                "¿Cómo puedo contactar con el servicio al cliente?",
                "¿Quién puedo hablar para resolver un problema?",
                "¿Cuál es el procedimiento para devolver un producto?",
                "¿Cómo puedo hacer una queja?"
            ],
            "responses": [
                "Puede contactar con nuestro servicio al cliente a través de nuestro número telefónico, correo electrónico o a través de nuestra página web.",
                "Por favor, póngase en contacto con nuestro servicio al cliente para resolver cualquier problema que tenga.",
                "Por favor, siga las instrucciones en nuestra política de devoluciones en nuestra página web o póngase en contacto con nuestro servicio al cliente para obtener más información sobre cómo devolver un producto.",
                "Por favor, póngase en contacto con nuestro servicio al cliente para hacer cualquier tipo de queja. Las redes se encuentran en la parte inferior de la pagina."
            ]
        },
        {
            "tag": "servicioCliente0",
            "patterns": [
                "¿Qué puedo hacer si tengo algún problema con mi pedido?"
            ],
            "responses": [
                "Le pedimos que por favor se ponga en contacto con nuestro servicio al cliente si tiene algún problema con su pedido. Podemos ayudarlo con cualquier pregunta o problema que tenga con su pedido, incluyendo cambios, devoluciones y reembolsos."
            ]
        },
        {
            "tag": "servicioCliente1",
            "patterns": [
                "¿Cómo puedo rastrear mi pedido?"
            ],
            "responses": [
                "Usted puede rastrear su pedido ingresando a su cuenta en nuestra tienda online o póngase en contacto con nuestro servicio al cliente para obtener información actualizada sobre el estado de su pedido y la fecha de entrega."
            ]
        },
        {
            "tag": "servicioCliente2",
            "patterns": [
                "¿Qué hago si recibí un producto dañado o defectuoso?"
            ],
            "responses": [
                "Lamentamos que haya recibido un producto dañado o defectuoso. Por favor contáctenos lo antes posible y haremos lo necesario para solucionar el problema y procesar un reemplazo o devolución."
            ]
        },
        {
            "tag": "servicioCliente3",
            "patterns": [
                "¿Cómo puedo cambiar mi dirección de envío?"
            ],
            "responses": [
                "Por favor contáctenos si necesita cambiar su dirección de envío. Haremos lo posible para actualizar su información antes de que su pedido sea enviado."
            ]
        },
        {
            "tag": "servicioCliente4",
            "patterns": [
                "¿Cómo puedo obtener un reembolso?"
            ],
            "responses": [
                "Por favor siga las instrucciones en nuestra política de devoluciones y reembolsos en nuestra página web o póngase en contacto con nuestro servicio al cliente para obtener más información sobre cómo procesar un reembolso."
            ]
        },
        {
            "tag": "servicioCliente5",
            "patterns": [
                "¿Ofrecen garantía en sus productos?"
            ],
            "responses": [
                "Sí, ofrecemos garantía en nuestros productos de acuerdo a lo establecido en nuestra política de garantía. Por favor visite nuestra página web o póngase en contacto con nuestro servicio al cliente para obtener más información."
            ]
        },
        {
            "tag": "servicioCliente6",
            "patterns": [
                "¿Cómo puedo contactar con el servicio al cliente?"
            ],
            "responses": [
                "Puede contactar con nuestro servicio al cliente a través de nuestro número telefónico, correo electrónico o a través de nuestra página web. Estaremos encantados de ayudarle con cualquier pregunta o problema que tenga."
            ]
        },
        {
            "tag": "servicioCliente7",
            "patterns": [
                "¿Qué hago si mi pedido no llega a tiempo?"
            ],
            "responses": [
                "Lamentamos si su pedido no llega a tiempo. Por favor contáctenos y haremos lo posible para solucionar el problema y proporcionarle una solución satisfactoria."
            ]
        },
        {
            "tag": "servicioCliente8",
            "patterns": [
                "¿Ofrecen atención en español?"
            ],
            "responses": [
                "Sí, ofrecemos atención al cliente en español para ayudarlo con cualquier pregunta o problema que tenga."
            ]
        },
        {
            "tag": "servicioCliente9",
            "patterns": [
                "¿Cómo puedo hacer una sugerencia o comentario?"
            ],
            "responses": [
                "Agradecemos sus sugerencias y comentarios. Por favor contáctenos a través de nuestro correo electrónico o a través de nuestra página web para hacer cualquier sugerencia o comentario. Tambien puede dejarnos una reseña en la seccion Reseña de la pagina web!"
            ]
        },
        {
            "tag": "servicioCliente10",
            "patterns": [
                "¿Cómo puedo obtener información sobre su política de privacidad?"
            ],
            "responses": [
                "Por favor visite nuestra página web para obtener información sobre nuestra política de privacidad y cómo tratamos y protegemos su información personal."
            ]
        },
        {
            "tag": "servicioCliente11",
            "patterns": [
                "¿Cómo puedo obtener información sobre sus términos y condiciones?"
            ],
            "responses": [
                "Estos se encuentran en la parte de registro de la pagina web!"
            ]
        },
        {
            "tag": "servicioCliente12",
            "patterns": [
                "¿Cómo puedo obtener información sobre sus promociones y descuentos?"
            ],
            "responses": [
                "Por favor siga nuestras redes sociales para obtener información sobre nuestras promociones y descuentos actuales."
            ]
        },
        {
            "tag": "servicioCliente15",
            "patterns": [
                "¿Cómo puedo obtener información sobre las tiendas físicas y puntos de venta?"
            ],
            "responses": [
                "Estamos ubicados en guayaquil, cerca del gran Aki de la avenida amazonas. Puede obtener mas detalles por nuestras redes!"
            ]
        },
        {
            "tag": "tiempoProduccion",
            "patterns": [
                "¿Cuánto tiempo se tarda en tejer una prenda de ropa?"
            ],
            "responses": [
                "El tiempo que se tarda en tejer una prenda de ropa varía dependiendo del diseño y complejidad de la prenda. Sin embargo, en promedio, se tarda entre unas pocas horas a varios días en tejer una prenda de ropa a mano."
            ]
        },
        {
            "tag": "lanaHipoalergenica",
            "patterns": [
                "¿Es la lana que utilizan hipoalergénica?"
            ],
            "responses": [
                "La lana es un material natural y no está tratada con productos químicos, por lo general es considerada hipoalergénica. Sin embargo, algunas personas pueden tener reacciones alérgicas a la lana debido a su naturaleza natural. Si usted es alérgico a la lana, le recomendamos que consulte con su médico antes de comprar nuestros productos."
            ]
        },
        {
            "tag": "Accesorios",
            "patterns": [
                "¿Venden accesorios además de ropa?"
            ],
            "responses": [
                "Sí, además de ropa, vendemos una variedad de accesorios como bufandas, gorros, guantes, etc. Por favor visite nuestra página web o tiendas físicas para obtener información sobre nuestra selección de accesorios."
            ]
        },
        {
            "tag": "personalizacion",
            "patterns": [
                "¿Ofrecen servicio de personalización de ropa?",
                "¿Puedo personalizar mi ropa?",
                "¿Pueden hacer un diseño personalizado para mi ropa?"
            ],
            "responses": [
                "Sí, ofrecemos servicio de personalización de ropa. Por favor contáctenos para obtener más información sobre cómo personalizar su ropa y hacer un diseño personalizado para usted."
            ]
        },
        {
            "tag": "envioInternacional",
            "patterns": [
                "¿Hacen envíos a otros países?",
                "¿Puedo hacer un pedido desde fuera de mi país?",
                "¿Envían a mi país?"
            ],
            "responses": [
                "Lamentablemente, no ofrecemos envíos a otros países en este momento. Sólo hacemos envíos dentro de nuestro país.",
                "Actualmente no hacemos envíos fuera de nuestro país.",
                "Lo sentimos, no enviamos a países fuera de nuestra zona de servicio."
            ]
        }
    ]
}